1
a. В каких случаях необходима была явная передача указателя в качестве входных параметров и возвращаемых результатов или в качестве приёмника в методах?
В случаях с массивами, слайсами, типами и структурами

b. В каких случаях мы фактически имеем дело с указателями при передаче параметров, хотя явно их не указываем?
в тех же, что и в пункте а?

2. Для арифметического умножения и разыменования указателей в Go используется один и тот же символ — оператор (*). Как вы думаете, как компилятор Go понимает, в каких случаях в выражении имеется в виду умножение, а в каких — разыменование указателя?
нет второй переменной